    "use strict";

    // №1

    // Возведите число 2 в 10-ю степень. Выведите результат на экран.

    let a = 2;
    let b = 10;
    alert(a ** b);


    // №2

    // Не запуская код, определите, что выведется на экран:

    // let a = 3 * 2 ** 3;
    // alert(a);

    // (24)


    // №3

    // Не запуская код, определите, что выведется на экран:

    // let a = (3 * 2) ** 3;
    // alert(a);

    // (216)


    // №4

    // Не запуская код, определите, что выведется на экран:

    // let a = 3 * 2 ** (3 + 1);
    // alert(a);

    // (48)


    //№5

    // Не запуская код, определите, что выведется на экран:

    // let a = 2 ** 3 * 3;
    // alert(a);

    // (24)


    // №6

    // Не запуская код, определите, что выведется на экран:

    // let a = 3 * 2 ** 3 * 3;
    // alert(a);

    // (72)