    'use strict';

    // №1

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' + '2';
    // alert(a);

    // (52)

    // №2

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' + 2;
    // alert(a);

    // (52)

    // №3

    // Не запуская код, определите, что выведется на экран:

    // let a = 5 + '2';
    // alert(a);

    // (52)

    // №4

    // Не запуская код, определите, что выведется на экран:

    // let a = 5 + 2;
    // alert(a);

    // (7)

    // №5

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' * '2';
    // alert(a);

    // (10)

    // №6

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' - '2';
    // alert(a);

    // (3)

    // №7

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' / '2';
    // alert(a);

    // (2.5)

    // №8

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' % '2';
    // alert(a);

    // (1)

    // №9

    // Не запуская код, определите, что выведется на экран:

    // let a = '5s' * '2';
    // alert(a);

    // (NaN)

    // №10

    // Не запуская код, определите, что выведется на экран:

    // let a = '5s' + '2';
    // alert(a);

    // (5s2)

    // №11

    // Не запуская код, определите, что выведется на экран:

    // let a = (-'5') + (-'2');
    // alert(a);

    // (-7)

    // №12

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' * 1 + '2' * 1;
    // alert(a);

    // (7)

    // №13

    // Не запуская код, определите, что выведется на экран:

    // let a = '5' * '1' + '2' * '1';
    // alert(a);

    // (7)

    // №14

    // Не запуская код, определите, что выведется на экран:

    let a = '' + 3 + 1;
    alert(a);

    // (31)