    "use strict";

    // №1

    // Найдите количество секунд в сутках.

    console.log(60 * 60 * 24);

    // №2

    // Найдите количество секунд в 30 сутках.

    console.log(60 * 60 * 24 * 30);

    // №3

    // Найдите количество секунд в году.

    console.log(60 * 60 * 24 * 365);

    // №4

    // Найдите количество минут в сутках.

    console.log(60 * 24);

    // №5

    // Найдите количество минут в году.

    console.log(60 * 24 * 365);

    // №6

    // Найдите количество байт в мегабайте.

    console.log(1024 * 1024);

    // №7

    // Найдите количество байт в гигабайте.

    console.log(1024 * 1024 * 1024);

    // №8

    // Найдите количество байт в 10 гигабайтах.

    console.log(1024 * 1024 * 1024 * 10);

    // №9

    // Найдите количество байт в терабайте.

    console.log(1024 * 1024 * 1024 * 1024);

    // №10

    // Найдите количество килобайт в терабайте.

    console.log(1024 * 1024 * 1024);

    console.log(Math.pow(33, 2));