    
    "use strict";

    //№1

    // Спросите возраст пользователя с помощью функции prompt. Выведите с помощью alert введенный пользователем возраст

    let age = prompt('Сколько вам лет ?');
    alert(`Вам ${age}`);

    // №2

    // Переделайте приведенный выше код так, чтобы суммировались числа, а не строки.

    let num1 = prompt('Введите первое число');
    let num2 = prompt('Введите второе число');

    alert(Number(num1) + Number(num2));

    // №3

    // С помощью функции prompt спросите у пользователя сторону квадрата. Выведите на экран площадь введенного квадрата.
