    "use strict";

    // №1

    // Выведите в окно браузера какой-нибудь текст.

    document.write('Какой-нибудь текст<br>');

    // №2

    // Выведите в окно браузера какой-нибудь текст, сделав его курсивным.

    document.write('<i>Какой-нибудь текст</i><br>');

    // №3

    // Дана переменная:

    // let str = 'text';
    // Выведите текст из переменной в окно браузера так, чтобы он был курсивным.

    let str = 'Какой-нибудь текст';

    document.write('<em>' + str + '</em><br>');

    // №4

    // Выведите в окно браузера столбец чисел от 1 до 5.

    document.write(1 + '<br>' + 2 + '<br>' + 3 + '<br>' + 4 + '<br>' + 5);
