    'use strict';

    // №1

    // Не запуская код, определите, что выведется на экран:

    // alert(true + 3);

    // (4)

    // №2⊗

    // Не запуская код, определите, что выведется на экран:

    // alert(true + true);

     // (2)

     // №3

    // Не запуская код, определите, что выведется на экран:

    // alert(true - true);

    // (0)

    // №4

    // Не запуская код, определите, что выведется на экран:

    // alert(true + false);

    // (1)

    // №5

    // Не запуская код, определите, что выведется на экран:

    // alert('1' + true);

    // (1true)

    // №6

    // Не запуская код, определите, что выведется на экран:

    // alert( String(true) + 1 );

    // (true1)

    // №7⊗jsPmBsLTC

    // Не запуская код, определите, что выведется на экран:

    // alert( String(true) + Number(true) ); 