    "use strict";

    // №1

    // Объявите переменную, не задавая ей значения. Выведите значение созданной переменной на экран.

    let undefine;

    alert(undefine);

    // №2

    // Присвойте переменной значение null. Выведите эту переменную на экран.

    let nul = null;

    alert(nul);

    // №3

    // Присвойте переменной значение true. Выведите эту переменную на экран.

    let tru = true;

    alert(tru);

    // №4

    // Присвойте переменной значение false. Выведите эту переменную на экран.

    let fals = false;

    alert(fals);

    // №5

    // Сделайте две строки. Перемножьте их друг на друга. Выведите результат умножения на экран.

    let str1 = 'abc';
    let str2 = 'def';

    alert(str1 * str2);

    // №6

    // Поделите число 10 на 0. Выведите результат на экран.

    alert(10 / 0);

    // №7

    // Поделите число -10 на 0. Выведите результат на экран.

    alert(-10 / 0);