    "use strict";

    // №1

    // Переделайте этот код так, чтобы в нем операции инкремента и декремента:

    // let num = 10;
    // num = num + 1;
    // num = num + 1;
    // num = num - 1;
    // alert(num);

    // let num = 10;
    // num++;
    // num++;
    // num--;
    // alert(num);

    // №2

    // Не запуская код, определите, что выведется на экран:

    // let num = 3;
    // alert(++num);

    // (4)

    // №3

    // Не запуская код, определите, что выведется на экран:

    // let num = 3;
    // alert(num++);

    //alert(num);

    // (3 потом 4)

    // №4

    // Не запуская код, определите, что выведется на экран:

    // let num = 3;
    // alert(--num);

    // (2)

    // №5

    // Не запуская код, определите, что выведется на экран:

    // let num = 3;
    // alert(num--);

    // (3)

    // №6

    // Не запуская код, определите, что выведется на экран:

    // let num1 = 3;
    // let num2 = ++num1;
    // alert(num1);
    // alert(num2);

    // (4, 4)

    // №7

    // Не запуская код, определите, что выведется на экран:

    // let num1 = 3;
    // let num2 = num1++;
    // alert(num1);
    // alert(num2);

    // (4, 3)

    // №8

    // Не запуская код, определите, что выведется на экран:

    // let num1 = 3;
    // let num2 = --num1;
    // alert(num1);
    // alert(num2);

    // (2, 2)

    // №9

    // Не запуская код, определите, что выведется на экран:

    // let num1 = 3;
    // let num2 = num1--;
    // alert(num1);
    // alert(num2);

    // (2, 3)


    // №10

    // Не запуская код, определите, что выведется на экран:

    let num1 = 3;
    num1++;
    let num2 = num1--;
    alert(num1++);
    alert(--num2);

    // (3, 3)