    'use strict';

    // №1

    // Даны две переменные с числами. Сложите значения этих переменных как строки и выведите результат на экран.

    let num1 = 20;
    let num2 = 22;
    let num3 = String(num1) + String(num2);

    console.log(num3);

    // №2

    // Дана переменная с числом. Найдите количество цифр в этом числе.

    let num4 = 2022;

    console.log(String(num4).length);

    // №3

    // Даны две переменные с числами. Найдите количество цифр в одном и во втором числе, результаты сложите и выведите на экран.

    let num5 = 20;
    let num6 = 22;

    console.log(String(num5).length + String(num6).length);